zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_pmu.h
/**
  * @brief    Get pinx wakeup flag
  * @rmtoll   WKFR    WKPXF    FL_PMU_IsActiveFlag_WakeupPIN
  * @param    PMUx PMU instance
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref FL_PMU_WAKEUP0_PIN
  *           @arg @ref FL_PMU_WAKEUP1_PIN
  *           @arg @ref FL_PMU_WAKEUP2_PIN
  *           @arg @ref FL_PMU_WAKEUP3_PIN
  *           @arg @ref FL_PMU_WAKEUP4_PIN
  *           @arg @ref FL_PMU_WAKEUP5_PIN
  *           @arg @ref FL_PMU_WAKEUP6_PIN
  *           @arg @ref FL_PMU_WAKEUP7_PIN
  *           @arg @ref FL_PMU_WAKEUP8_PIN
  *           @arg @ref FL_PMU_WAKEUP9_PIN
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_PMU_IsActiveFlag_WakeupPIN(PMU_Type* PMUx, uint32_t Pin)
{
    return (uint32_t)(READ_BIT(PMUx->WKFR, ((Pin & 0x201ffU) << 0x0U)) == ((Pin & 0x201ffU) << 0x0U));
}

/**
  * @brief    Clear pinx wakeup flag
  * @rmtoll   WKFR    WKPXF    FL_PMU_ClearFlag_WakeupPIN
  * @param    PMUx PMU instance
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref FL_PMU_WAKEUP0_PIN
  *           @arg @ref FL_PMU_WAKEUP1_PIN
  *           @arg @ref FL_PMU_WAKEUP2_PIN
  *           @arg @ref FL_PMU_WAKEUP3_PIN
  *           @arg @ref FL_PMU_WAKEUP4_PIN
  *           @arg @ref FL_PMU_WAKEUP5_PIN
  *           @arg @ref FL_PMU_WAKEUP6_PIN
  *           @arg @ref FL_PMU_WAKEUP7_PIN
  *           @arg @ref FL_PMU_WAKEUP8_PIN
  *           @arg @ref FL_PMU_WAKEUP9_PIN
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_ClearFlag_WakeupPIN(PMU_Type* PMUx, uint32_t Pin)
{
    if (FL_PMU_WAKEUP9_PIN == Pin)
    {
        WRITE_REG(PMUx->WKFR, PMU_WKFR_DBGWKF_Msk);
    }
    else
    {
        WRITE_REG(PMUx->WKFR, ((Pin & 0x1ffU) << 0x0U));
    }
}

/**
  * @brief    Sleep error interrupt enable
  * @rmtoll   IER    SLPEIE    FL_PMU_EnableIT_SleepError
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableIT_SleepError(PMU_Type* PMUx)
{
    SET_BIT(PMUx->IER, PMU_IER_SLPEIE_Msk);
}

/**
  * @brief    Get sleep error interrupt enable status
  * @rmtoll   IER    SLPEIE    FL_PMU_IsEnabledIT_SleepError
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledIT_SleepError(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->IER, PMU_IER_SLPEIE_Msk) == PMU_IER_SLPEIE_Msk);
}

/**
  * @brief    Sleep error interrupt disable
  * @rmtoll   IER    SLPEIE    FL_PMU_DisableIT_SleepError
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableIT_SleepError(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->IER, PMU_IER_SLPEIE_Msk);
}

/**
  * @brief    Get SLEEP error interrupt flag
  * @rmtoll   ISR    SLPEIF    FL_PMU_IsActiveFlag_SleepError
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsActiveFlag_SleepError(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->ISR, PMU_ISR_SLPEIF_Msk) == (PMU_ISR_SLPEIF_Msk));
}

/**
  * @brief    Clear SLEEP error interrupt flag
  * @rmtoll   ISR    SLPEIF    FL_PMU_ClearFlag_SleepError
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_ClearFlag_SleepError(PMU_Type* PMUx)
{
    WRITE_REG(PMUx->ISR, PMU_ISR_SLPEIF_Msk);
}

/**
  * @brief    Enable AVREF Buffer Output
  * @rmtoll   BUFCR    AVREFBUF_OUTEN    FL_PMU_EnableAVREFBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableAVREFBufferOutput(PMU_Type* PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_OUTEN_Msk);
}

/**
  * @brief    Get AVREF Buffer Output Enable Status
  * @rmtoll   BUFCR    AVREFBUF_OUTEN    FL_PMU_IsEnabledAVREFBufferOutput
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledAVREFBufferOutput(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_OUTEN_Msk) == PMU_BUFCR_AVREFBUF_OUTEN_Msk);
}

/**
  * @brief    Disable AVREF Buffer Output
  * @rmtoll   BUFCR    AVREFBUF_OUTEN    FL_PMU_DisableAVREFBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableAVREFBufferOutput(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_OUTEN_Msk);
}

/**
  * @brief    Enable AVREF Buffer
  * @rmtoll   BUFCR    AVREFBUF_EN    FL_PMU_EnableAVREFBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableAVREFBuffer(PMU_Type* PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_EN_Msk);
}

/**
  * @brief    Get AVREF Buffer Enable Status
  * @rmtoll   BUFCR    AVREFBUF_EN    FL_PMU_IsEnabledAVREFBuffer
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledAVREFBuffer(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_EN_Msk) == PMU_BUFCR_AVREFBUF_EN_Msk);
}

/**
  * @brief    Disable AVREF Buffer 
  * @rmtoll   BUFCR    AVREFBUF_EN    FL_PMU_DisableAVREFBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableAVREFBuffer(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_EN_Msk);
}

/**
  * @brief    Enable VPTAT Buffer Output
  * @rmtoll   BUFCR    VPTATBUFFER_OUTEN    FL_PMU_EnableVPTATBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableVPTATBufferOutput(PMU_Type* PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_OUTEN_Msk);
}

/**
  * @brief    Get VPTAT Buffer Output Enable Status
  * @rmtoll   BUFCR    VPTATBUFFER_OUTEN    FL_PMU_IsEnabledVPTATBufferOutput
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledVPTATBufferOutput(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_OUTEN_Msk) == PMU_BUFCR_VPTATBUFFER_OUTEN_Msk);
}

/**
  * @brief    Disable VPTAT Buffer Output
  * @rmtoll   BUFCR    VPTATBUFFER_OUTEN    FL_PMU_DisableVPTATBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableVPTATBufferOutput(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_OUTEN_Msk);
}

/**
  * @brief    Enable VPTAT Buffer
  * @rmtoll   BUFCR    VPTATBUFFER_EN    FL_PMU_EnableVPTATBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableVPTATBuffer(PMU_Type* PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_EN_Msk);
}

/**
  * @brief    Get VPTAT Buffer Enable Status
  * @rmtoll   BUFCR    VPTATBUFFER_EN    FL_PMU_IsEnabledVPTATBuffer
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledVPTATBuffer(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_EN_Msk) == PMU_BUFCR_VPTATBUFFER_EN_Msk);
}

/**
  * @brief    Disable VPTAT Buffer 
  * @rmtoll   BUFCR    VPTATBUFFER_EN    FL_PMU_DisableVPTATBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableVPTATBuffer(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_EN_Msk);
}

/**
  * @brief    Enable Temperatue Sensor
  * @rmtoll   PTAT_CR    PTAT_EN    FL_PMU_EnableTemperatureSensor
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableTemperatureSensor(PMU_Type* PMUx)
{
    SET_BIT(PMUx->PTAT_CR, PMU_PTAT_CR_PTAT_EN_Msk);
}

/**
  * @brief    Get Temperatue Sensor Enable Status
  * @rmtoll   PTAT_CR    PTAT_EN    FL_PMU_IsEnabledTemperatureSensor
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledTemperatureSensor(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->PTAT_CR, PMU_PTAT_CR_PTAT_EN_Msk) == PMU_PTAT_CR_PTAT_EN_Msk);
}

/**
  * @brief    Disable Temperatue Sensor
  * @rmtoll   PTAT_CR    PTAT_EN    FL_PMU_DisableTemperatureSensor
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableTemperatureSensor(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->PTAT_CR, PMU_PTAT_CR_PTAT_EN_Msk);
}

/**
  * @brief    CANFD1 Asycnchronous  WakeUp Interrupt Enable
  * @rmtoll   CFDCK_CR    CFD1WKIE    FL_PMU_EnableIT_CANFD1WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableIT_CANFD1WakeUpInterrupt(PMU_Type* PMUx)
{
    SET_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD1WKIE_Msk);
}

/**
  * @brief    Get CANFD1 Asycnchronous WakeUp Interrupt Enable status
  * @rmtoll   CFDCK_CR    CFD1WKIE    FL_PMU_IsEnabledIT_CANFD1WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledIT_CANFD1WakeUpInterrupt(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD1WKIE_Msk) == PMU_CFDCK_CR_CFD1WKIE_Msk);
}

/**
  * @brief    CANFD1 Asycnchronous WakeUp Interrupt Disable
  * @rmtoll   CFDCK_CR    CFD1WKIE    FL_PMU_DisableIT_CANFD1WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableIT_CANFD1WakeUpInterrupt(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD1WKIE_Msk);
}

/**
  * @brief    CANFD0 Asycnchronous WakeUp Interrupt Enable
  * @rmtoll   CFDCK_CR    CFD0WKIE    FL_PMU_EnableIT_CANFD0WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableIT_CANFD0WakeUpInterrupt(PMU_Type* PMUx)
{
    SET_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD0WKIE_Msk);
}

/**
  * @brief    Get CANFD0 Asycnchronous WakeUp Interrupt Enable status
  * @rmtoll   CFDCK_CR    CFD0WKIE    FL_PMU_IsEnabledIT_CANFD0WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledIT_CANFD0WakeUpInterrupt(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD0WKIE_Msk) == PMU_CFDCK_CR_CFD0WKIE_Msk);
}

/**
  * @brief    CANFD0 Asycnchronous WakeUp Interrupt Disable
  * @rmtoll   CFDCK_CR    CFD0WKIE    FL_PMU_DisableIT_CANFD0WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableIT_CANFD0WakeUpInterrupt(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD0WKIE_Msk);
}

/**
  * @brief    CANFD1 Asycnchronous WakeUp Enable
  * @rmtoll   CFDCK_CR    CFD1WKEN    FL_PMU_EnableCANFD1WakeUp
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableCANFD1WakeUp(PMU_Type* PMUx)
{
    SET_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD1WKEN_Msk);
}

/**
  * @brief    Get CANFD1 Asycnchronous WakeUp Enable status
  * @rmtoll   CFDCK_CR    CFD1WKEN    FL_PMU_IsEnabledCANFD1WakeUp
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledCANFD1WakeUp(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD1WKEN_Msk) == PMU_CFDCK_CR_CFD1WKEN_Msk);
}

/**
  * @brief    CANFD1 Asycnchronous WakeUp Disable
  * @rmtoll   CFDCK_CR    CFD1WKEN    FL_PMU_DisableCANFD1WakeUp
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableCANFD1WakeUp(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD1WKEN_Msk);
}

/**
  * @brief    CANFD0 Asycnchronous WakeUp Enable
  * @rmtoll   CFDCK_CR    CFD0WKEN    FL_PMU_EnableCANFD0WakeUp
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableCANFD0WakeUp(PMU_Type* PMUx)
{
    SET_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD0WKEN_Msk);
}

/**
  * @brief    Get CANFD0 Asycnchronous WakeUp Enable status
  * @rmtoll   CFDCK_CR    CFD0WKEN    FL_PMU_IsEnabledCANFD0WakeUp
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledCANFD0WakeUp(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD0WKEN_Msk) == PMU_CFDCK_CR_CFD0WKEN_Msk);
}

/**
  * @brief    CANFD0 Asycnchronous WakeUp Disable
  * @rmtoll   CFDCK_CR    CFD0WKEN    FL_PMU_DisableCANFD0WakeUp
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableCANFD0WakeUp(PMU_Type* PMUx)
{
    CLEAR_BIT(PMUx->CFDCK_CR, PMU_CFDCK_CR_CFD0WKEN_Msk);
}

/**
  * @brief    Get CANFD1 Asycnchronous WakeUp Interrupt Flag
  * @rmtoll   CFDCK_SR    CFD1WKIF    FL_PMU_IsActiveFlag_CANFD1WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsActiveFlag_CANFD1WakeUpInterrupt(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->CFDCK_SR, PMU_CFDCK_SR_CFD1WKIF_Msk) == (PMU_CFDCK_SR_CFD1WKIF_Msk));
}

/**
  * @brief    Clear CANFD1 Asycnchronous WakeUp Interrupt Flag
  * @rmtoll   CFDCK_SR    CFD1WKIF    FL_PMU_ClearFlag_CANFD1WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_ClearFlag_CANFD1WakeUpInterrupt(PMU_Type* PMUx)
{
    WRITE_REG(PMUx->CFDCK_SR, PMU_CFDCK_SR_CFD1WKIF_Msk);
}

/**
  * @brief    Get CANFD0 Asycnchronous WakeUp Interrupt Flag
  * @rmtoll   CFDCK_SR    CFD0WKIF    FL_PMU_IsActiveFlag_CANFD0WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsActiveFlag_CANFD0WakeUpInterrupt(PMU_Type* PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->CFDCK_SR, PMU_CFDCK_SR_CFD0WKIF_Msk) == (PMU_CFDCK_SR_CFD0WKIF_Msk));
}

/**
  * @brief    Clear CANFD0 Asycnchronous WakeUp Interrupt Flag
  * @rmtoll   CFDCK_SR    CFD0WKIF    FL_PMU_ClearFlag_CANFD0WakeUpInterrupt
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_ClearFlag_CANFD0WakeUpInterrupt(PMU_Type* PMUx)
{
    WRITE_REG(PMUx->CFDCK_SR, PMU_CFDCK_SR_CFD0WKIF_Msk);
}

/**
  * @}
  */

/** @defgroup PMU_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_PMU_Sleep_DeInit(PMU_Type *PMUx);
FL_ErrorStatus FL_PMU_Sleep_Init(PMU_Type *PMUx, FL_PMU_SleepInitTypeDef *LPM_InitStruct);
void FL_PMU_StructInit(FL_PMU_SleepInitTypeDef *LPM_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FG0XXA_FL_PMU_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-03-27*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
